app/views/users/show.html.erb

<h2>Current Reservations</h2>
<% @user.reservations.each do |r| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]

<h2>Loyalty Points</h2>
<%= @user.reservations.count %> POINTS!!!!!!!!!<br>
---
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]