app/views/restaurants/_form.html.erb

  <%= f.label :category %><br>
  <%= f.select :category_id, Category.all.collect {|c| [c.name, c.id]} %>
---
SELECT "categories".* FROM "categories"