app/views/restaurants/index.html.erb

  <%= form_tag(restaurants_path, method: "GET") do %>
  <%= select_tag "category_choice", options_for_select(Category.all.collect { |c| [c.name, c.id]}) %>
---
SELECT "categories".* FROM "categories"

  <%= form_tag(restaurants_path, method: "GET") do %>
  <%= select_tag "neighbourhood_choice", options_for_select(Restaurant.all.collect { |r| [r.neighbourhood]}.uniq) %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."neighbourhood" = 'Downtown'

<% if params[:category_choice] %>
<% result = Restaurant.find_all_by_category_id(params[:category_choice]) %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."category_id" = ?  [["category_id", 1]]