app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("created_at", "guests", "restaurant_id", "time", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 18 Nov 2013 20:40:06 UTC +00:00], ["guests", 2], ["restaurant_id", 4], ["time", Fri, 22 Nov 2013 20:00:00 UTC +00:00], ["updated_at", Mon, 18 Nov 2013 20:40:06 UTC +00:00]]
---
  def create
    @reservation = Reservation.new(reservation_params)
    @reservation.user = current_user
    if @reservation.save