app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("address", "capacity", "category_id", "created_at", "name", "neighbourhood", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @restaurant = Restaurant.find(params[:id])
    if @restaurant.update_attributes(restaurant_params)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "restaurants" SET "neighbourhood" = ?, "category_id" = ?, "updated_at" = ? WHERE "restaurants"."id" = 4  [["neighbourhood", "Downtown"], ["category_id", 2], ["updated_at", Sat, 16 Nov 2013 20:26:40 UTC +00:00]]