app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "name", "neighbourhood", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)